0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
/*
    top
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);

        //type            advective;
    }

    sym1
    {
        type            symmetry;
    }

    sym2
    {
        type            symmetry;
    }

    bottom
    {

        type            fixedValue;
        value           uniform (0 0 0);

//      type            zeroGradient;
    }

    heated_body
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
*/

	Th
	{	
		type		fixedValue;
		value		uniform (0 0 0);
	}

	Tc
	{
		type		fixedValue;
		value		uniform (0 0 0);
	}

	bottom
	{
		type		noSlip;
	}

	top
	{
		type		noSlip;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	
	}
}

// ************************************************************************* //
