0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      kappat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
/*
    top
    {

        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;


        type            fixedValue;
        value           uniform 0;


        type            zeroGradient;
    }

    sym1
    {
        type            symmetry;
    }

    sym2
    {
        type            symmetry;
    }

    bottom
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;


        type            fixedValue;
        value           uniform 0;


//        type            zeroGradient;
    }

    heated_body
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        value           uniform 0;


        type            fixedValue;
        value           uniform 0;


//        type            zeroGradient;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
*/

	Th
	{	
		type		calculated; //zeroGradient
		value		uniform 0;
	}

	Tc
	{
		type		calculated; //zeroGradient;
		value		uniform 0;
	}

	bottom
	{
        	type            alphatJayatillekeWallFunction;
       		Prt             0.85;
        	value           uniform 0;
	}

	top
	{
		type            alphatJayatillekeWallFunction;
        	Prt             0.85;
        	value           uniform 0;
	}

	front
	{
		type		empty;
	}

	back
	{
		type		empty;
	
	}
}

// ************************************************************************* //
