constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Th
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       2614;
    }
    Tc
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       2646;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          42;
        startFace       2678;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          42;
        startFace       2720;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1344;
        startFace       2762;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1344;
        startFace       4106;
    }
)

// ************************************************************************* //
