system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin 0;
xmax 0.0889;
ymin 0;
ymax 0.0635;
zmin 0;
zmax 0.001;

vertices 
(

    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)
);

blocks 
(
    hex (0 1 2 3 4 5 6 7) (42 32 1) simpleGrading (1 1 1)
);

edges 
( 
);

patches         
(
    wall Th
    (
        (0 4 7 3)
    )
    wall Tc
    (
        (2 6 5 1)
    )
    wall bottom
    (
        (1 5 4 0)
    )
    wall top
    (
        (3 7 6 2)
    )
    empty back
    (
        (0 1 2 3)
    )
    empty front
    (
        (4 5 6 7)
    )
);


mergePatchPairs 
(
);
